In [82]:
import numpy as np
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [59]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
#engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM loan', connection_string)
data.head()

   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12    8033.0      B
1     5316        1801  930711  165960        36    4610.0      A
2     6863        9188  930728  127080        60    2118.0      A
3     5325        1843  930803  105804        36    2939.0      A
4     7240       11013  930906  274740        60    4579.0      A

In [60]:
'''query = select t.type, t.operation, t.amount as t_amount, t.balance, t.k_symbol, l.amount as l_amount, l.duration, l.payments, l.status
from trans t
left join loan l
on t.account_id = l.account_id;

data = pd.read_sql_query(query, engine)
data.head()'''

'query = select t.type, t.operation, t.amount as t_amount, t.balance, t.k_symbol, l.amount as l_amount, l.duration, l.payments, l.status\nfrom trans t\nleft join loan l\non t.account_id = l.account_id;\n\ndata = pd.read_sql_query(query, engine)\ndata.head()'

In [61]:
#engine.execute('Use bank')
pd.read_sql_table('district',connection_string)

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72,73,Opava,north Moravia,182027,17,49,12,2,7,56.4,8746,3.33,3.74,90,4355,4433
73,74,Ostrava - mesto,north Moravia,323870,0,0,0,1,1,100.0,10673,4.75,5.44,100,18782,18347
74,75,Prerov,north Moravia,138032,67,30,4,2,5,64.6,8819,5.38,5.66,99,4063,4505
75,76,Sumperk,north Moravia,127369,31,32,13,2,7,51.2,8369,4.73,5.88,107,3736,2807
76,77,Vsetin,north Moravia,148545,8,35,12,3,4,53.5,8909,4.01,5.56,113,3460,3590

In [62]:
data1 = pd.read_sql_query('select account_id,type,operation from trans',connection_string)

#data1.head()

In [63]:
data2 = pd.read_sql_query('select account_id,loan_id from loan',connection_string)

In [64]:
data1.head()

   account_id    type operation
0        2378  PRIJEM     VKLAD
1         576  PRIJEM     VKLAD
2         704  PRIJEM     VKLAD
3        3818  PRIJEM     VKLAD
4        1972  PRIJEM     VKLAD

In [65]:
data2.head()

   account_id  loan_id
0        1787     5314
1        1801     5316
2        9188     6863
3        1843     5325
4       11013     7240

In [66]:
data3 = pd.crosstab(data1['type'], data1['operation'], rownames=['type'], colnames=['type'])

In [67]:
data3.head()

type            PREVOD NA UCET  PREVOD Z UCTU   VKLAD   VYBER  VYBER KARTOU
type
PRIJEM  183112               0          41214  115624       0             0
VYBER        0               0              0       0   14092             0
VYDAJ        0          129484              0       0  377811          6682

In [68]:
query = 'select t1.account_id, t1.type, t1.operation, t2.loan_id from trans as t1 inner join loan as t2 on t1.account_id = t2.account_id'

data4 = pd.read_sql_query(query,connection_string)
data4.head()

   account_id    type      operation  loan_id
0        5270  PRIJEM  PREVOD Z UCTU     6077
1       11265  PRIJEM          VKLAD     7284
2       10364  PRIJEM          VKLAD     7121
3        3834  PRIJEM          VKLAD     5754
4        9307  PRIJEM          VKLAD     6895

In [69]:
data4 = pd.crosstab(data4['type'], data4['operation'], rownames=['type'], colnames=['type'])

In [70]:
data4.head()

type           PREVOD NA UCET  PREVOD Z UCTU  VKLAD  VYBER  VYBER KARTOU
type
PRIJEM  31337               0           5336  22633      0             0
VYBER       0               0              0      0   5347             0
VYDAJ       0           25796              0      0  64842           790

In [72]:
query = 'SELECT r.rental_date, inv.film_id, ficat.category_id \
FROM sakila.rental AS r \
JOIN sakila.inventory AS inv \
USING (inventory_id) \
JOIN sakila.film AS fi \
USING (film_id) \
JOIN sakila.film_category AS ficat \
USING (film_id) \
JOIN sakila.category AS cat \
USING (category_id) \
WHERE cat.category_id <= 5'
data5 = pd.read_sql_query(query,connection_string)

In [74]:
data5['rental_date'] = pd.to_datetime(data5['rental_date'])

In [76]:
data5['rental_year'] = pd.DatetimeIndex(data5['rental_date']).year
data5['rental_month'] = pd.DatetimeIndex(data5['rental_date']).month
data5 = data5.drop(['rental_date'],axis=1)

In [77]:
for i in data.columns:
    data[i] = data[i].astype(object)

In [78]:
y = data5['category_id']

cat = data5.drop(['category_id'], axis=1)

In [86]:
categorical = pd.get_dummies(cat, columns=['film_id', 'rental_year', 'rental_month'])

In [87]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(categorical, y, test_size=0.4, random_state=100)

In [88]:
categorical.shape

(5103, 300)

In [89]:
from sklearn.linear_model import LogisticRegression
classification = LogisticRegression(random_state=0, solver='lbfgs',
                  multi_class='multinomial').fit(X_train, y_train)

In [90]:
classification.score(X_test, y_test)

1.0

In [91]:
predictions = classification.predict(X_test)

In [92]:
pd.Series(predictions).value_counts()

2    472
1    458
3    378
5    373
4    361
dtype: int64

In [94]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test, predictions)

array([[458,   0,   0,   0,   0],
       [  0, 472,   0,   0,   0],
       [  0,   0, 378,   0,   0],
       [  0,   0,   0, 361,   0],
       [  0,   0,   0,   0, 373]])